# Task 4.9 Data Visualization with Python - Part 1

### This notebook contains:
    01. Importing Libraries
    02. Importing Data
    03. Data Preparation & Combination
        A. Data Wrangling
        B. Data Quality & Concistency Checks
        C. Combining Data
        D. Exporting Data

## 01. Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import os

## 02. Importing Data

In [2]:
# turning project folder path into string
path = r'/Users/lisa/DA Projects/12-2022 Instacart Basket Analysis'

In [3]:
# Importing customer data set
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [4]:
# Importing orders products merged
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_grouped.pkl'))

## 03. Data Cleaning

### A. Data Wrangling

In [5]:
# initial check columns
df_cust.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [6]:
# initial check shape
df_cust.shape

(206209, 10)

In [7]:
# initial check data types
df_cust.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

#### Renaming Columns

In [8]:
# changing column name First Name
df_cust.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [9]:
# changing column name Surnam
df_cust.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [10]:
# changing column name Gender
df_cust.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [11]:
# changing column name STATE
df_cust.rename(columns = {'STATE' : 'state'}, inplace = True)

In [12]:
# changing column name Age
df_cust.rename(columns = {'Age' : 'age'}, inplace = True)

In [13]:
# changing column name n_dependants
df_cust.rename(columns = {'n_dependants' : 'no_of_dependants'}, inplace = True)

In [14]:
# changing column name fam_status
df_cust.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [15]:
# checking results
df_cust.head(10)

,user_id,first_name,last_name,gender,state,age,date_joined,no_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [16]:
# checking shape
df_cust.shape

(206209, 10)

### B. Data Quality & Concistency Checks

#### Checking for mixed-type columns

In [17]:
# check for mixed-type columns
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

first_name

Mixed data type in column first_name. I will come back to that later because I want to see if there are NaNs first in case they influence the result of this test.

#### Missing Values

In [18]:
# checking for missing values
df_cust.isnull().sum()

user_id                 0
first_name          11259
last_name               0
gender                  0
state                   0
age                     0
date_joined             0
no_of_dependants        0
marital_status          0
income                  0
dtype: int64

In [19]:
# subsetting NaN's
df_nan = df_cust[df_cust['first_name'].isnull() == True]

In [20]:
#check subset
df_nan

,user_id,first_name,last_name,gender,state,age,date_joined,no_of_dependants,marital_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

I can't detect any other abnormalities other than missing first name.

In [21]:
df_nan.shape

(11259, 10)

In [22]:
# getting number of non-NaN values in first_name
df_cust['first_name'].notnull().sum()

194950

In [23]:
# quick calculation
11259+194950

206209

In [24]:
# calculating the percentile of missing first names
11259/(206209/100)

5.459994471628299

There are 11259 NaNs in column first_name, which makes up over 5 percent. But as each customer has a unique user_id we are still able to identify them. So the missing values have no negativ effects on our analysis. To circumvent any error I will convert the whole column into the data type string and leave the NaNs as they are.
Additionally I would inquire why these first names are missing as this could indicate a error in the data collection system.

In [25]:
# converting datatype of column first_name
df_cust['first_name'] = df_cust['first_name'].astype('str')

In [26]:
# checking data type again
df_cust.dtypes

user_id              int64
first_name          object
last_name           object
gender              object
state               object
age                  int64
date_joined         object
no_of_dependants     int64
marital_status      object
income               int64
dtype: object

In [27]:
# check for mixed-type columns again
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

Results show no more mixed data types. So as predicted the NaNs influenced the result for the mixed data type test.

In [28]:
df_cust.shape

(206209, 10)

#### Duplicates

In [44]:
# checking for duplicates
df_cust[df_cust.duplicated()]

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, no_of_dependants, marital_status, income]
Index: []

No duplicates

In [45]:
# Exporting final Customer Data as csv
df_cust.to_csv(os.path.join(path, '02 Data','Prepared Data', 'customers.csv'))

### C. Combining Data

In [46]:
# checking df customer
df_cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,no_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [49]:
# checking df ords prods merge
ords_prods_merge.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_price,spending_flag,order_freq,frequency_flag
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,both,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2398795,1,2,3,7,15.0,False,196,1,1,Soda,77,7,9.0,both,Mid-range product,Regularly busy,Less busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,473747,1,3,3,12,21.0,False,196,1,1,Soda,77,7,9.0,both,Mid-range product,Regularly busy,Less busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2254736,1,4,4,7,29.0,False,196,1,1,Soda,77,7,9.0,both,Mid-range product,Least busy,Less busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,431534,1,5,4,15,28.0,False,196,1,1,Soda,77,7,9.0,both,Mid-range product,Least busy,Less busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [48]:
# removing head() restrictions to see all columns
pd.options.display.max_columns = None

In [50]:
# removing prior merge flag from ords prods merge
ords_prods_merge = ords_prods_merge.drop(columns=['_merge'])

In [51]:
# check
ords_prods_merge.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_price,spending_flag,order_freq,frequency_flag
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2398795,1,2,3,7,15.0,False,196,1,1,Soda,77,7,9.0,Mid-range product,Regularly busy,Less busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,473747,1,3,3,12,21.0,False,196,1,1,Soda,77,7,9.0,Mid-range product,Regularly busy,Less busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2254736,1,4,4,7,29.0,False,196,1,1,Soda,77,7,9.0,Mid-range product,Least busy,Less busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,431534,1,5,4,15,28.0,False,196,1,1,Soda,77,7,9.0,Mid-range product,Least busy,Less busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [52]:
# checking shape customer before merge
df_cust.shape

(206209, 10)

In [53]:
# checking shape ords prods before merge
ords_prods_merge.shape

(32404859, 24)

In [54]:
# counting unique user_id in ords prods
ords_prods_merge['user_id'].nunique()

206209

In [55]:
# counting unique user_id in customer
df_cust['user_id'].nunique()

206209

In [56]:
# checking data type for key (df customer)
df_cust['user_id'].dtype

dtype('int64')

In [57]:
# checking data type for key (df ords prods)
ords_prods_merge['user_id'].dtype

dtype('int64')

In [58]:
# Merging dataframes
df_opc_merge = ords_prods_merge.merge(df_cust, on = 'user_id', indicator = True)

In [59]:
# checking results
df_opc_merge.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_price,spending_flag,order_freq,frequency_flag,first_name,last_name,gender,state,age,date_joined,no_of_dependants,marital_status,income,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2398795,1,2,3,7,15.0,False,196,1,1,Soda,77,7,9.0,Mid-range product,Regularly busy,Less busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,473747,1,3,3,12,21.0,False,196,1,1,Soda,77,7,9.0,Mid-range product,Regularly busy,Less busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2254736,1,4,4,7,29.0,False,196,1,1,Soda,77,7,9.0,Mid-range product,Least busy,Less busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,431534,1,5,4,15,28.0,False,196,1,1,Soda,77,7,9.0,Mid-range product,Least busy,Less busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [60]:
# Checking Frequency inner join
df_opc_merge['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [62]:
#checking shape merged df
df_opc_merge.shape

(32404859, 34)

In [63]:
# counting unique user_id in merged df
df_opc_merge['user_id'].nunique()

206209

Shape and number of unique user_id's is correct and merge frequency test shows desired result.

### D. Exporting Data

In [64]:
# Exporting the final Dataframe
df_opc_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_all.pkl'))